from pathlib import Path

RAW_FILES = Path("/var/data/raw")
NPY_FILES = Path("/var/data/npy")

DENIALS = "6. Плановые-Внеплановые отключения 01.10.2023-30.04.2023.xlsx"
MOEK = "7. Схема подключений МОЭК.xlsx"
ASUPR = "8. Данные АСУПР с диспетчерскими ОДС.xlsx"
BTI = "9. Выгрузка БТИ.xlsx"
ODPU = "11.Выгрузка_ОДПУ_отопление_ВАО_20240522.xlsx"
EEFF = "12. Класс энергоэффективности соцобъектов.xlsx"
ADDRESSES = "13. Адресный реестр объектов недвижимости города Москвы.xlsx"
HOUSES = "14. ВАО_Многоквартирные_дома_с_технико_экономическими_характеристиками.xlsx"

EVENT_DIR = "5. Перечень событий за период 01.10.2023-30.04.2023 (ЦУ КГХ)"
EVENTS1 = "События за период_01.10.2023-31.12.2023.xlsx"
EVENTS2 = "События за период_01.01.2024-30.04.2024.xlsx"
